hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_timer4.c
#define IS_VALID_TIMER4_PWM_CH(x)                                              \
(   ((x) == TIMER4_PWM_U)                       ||                             \
    ((x) == TIMER4_PWM_V)                       ||                             \
    ((x) == TIMER4_PWM_W))

#define IS_VALID_TIMER4_PWM_MODE(x)                                            \
(   ((x) == TIMER4_PWM_THROUGH_MODE)            ||                             \
    ((x) == TIMER4_PWM_DEAD_TIMER_MODE)         ||                             \
    ((x) == TIMER4_PWM_DEAD_TIMER_FILTER_MODE))

#define IS_VALID_TIMER4_PWM_OUTPUT_POLARITY(x)                                 \
(   ((x) == TIMER4_PWM_OP_OXH_HOLD_OXL_HOLD)    ||                             \
    ((x) == TIMER4_PWM_OP_OXH_INVERT_OXL_HOLD)  ||                             \
    ((x) == TIMER4_PWM_OP_OXH_HOLD_OXL_INVERT)  ||                             \
    ((x) == TIMER4_PWM_OP_OXH_INVERT_OXL_INVERT))

#define IS_VALID_TIMER4_PWM_CLK_DIV(x)                                         \
(   ((x) == TIMER4_PWM_CLK_DIV1)                ||                             \
    ((x) == TIMER4_PWM_CLK_DIV2)                ||                             \
    ((x) == TIMER4_PWM_CLK_DIV4)                ||                             \
    ((x) == TIMER4_PWM_CLK_DIV8)                ||                             \
    ((x) == TIMER4_PWM_CLK_DIV16)               ||                             \
    ((x) == TIMER4_PWM_CLK_DIV32)               ||                             \
    ((x) == TIMER4_PWM_CLK_DIV64)               ||                             \
    ((x) == TIMER4_PWM_CLK_DIV128))

#define IS_VALID_TIMER4_SEVT_CH(x)                                             \
(   ((x) == TIMER4_SEVT_UH)                     ||                             \
    ((x) == TIMER4_SEVT_UL)                     ||                             \
    ((x) == TIMER4_SEVT_VH)                     ||                             \
    ((x) == TIMER4_SEVT_VL)                     ||                             \
    ((x) == TIMER4_SEVT_WH)                     ||                             \
    ((x) == TIMER4_SEVT_WL))

#define IS_VALID_TIMER4_SEVT_MODE(x)                                           \
(   ((x) == TIMER4_SEVT_MODE_DELAY_TRIGGER)     ||                             \
    ((x) == TIMER4_SEVT_MODE_COMPARE_TRIGGER))

#define IS_VALID_TIMER4_SEVT_MASK(x)                                           \
(   ((x) == TIMER4_SEVT_MASK_0)                 ||                             \
    ((x) == TIMER4_SEVT_MASK_1)                 ||                             \
    ((x) == TIMER4_SEVT_MASK_2)                 ||                             \
    ((x) == TIMER4_SEVT_MASK_3)                 ||                             \
    ((x) == TIMER4_SEVT_MASK_4)                 ||                             \
    ((x) == TIMER4_SEVT_MASK_5)                 ||                             \
    ((x) == TIMER4_SEVT_MASK_6)                 ||                             \
    ((x) == TIMER4_SEVT_MASK_7)                 ||                             \
    ((x) == TIMER4_SEVT_MASK_8)                 ||                             \
    ((x) == TIMER4_SEVT_MASK_9)                 ||                             \
    ((x) == TIMER4_SEVT_MASK_10)                ||                             \
    ((x) == TIMER4_SEVT_MASK_11)                ||                             \
    ((x) == TIMER4_SEVT_MASK_12)                ||                             \
    ((x) == TIMER4_SEVT_MASK_13)                ||                             \
    ((x) == TIMER4_SEVT_MASK_14)                ||                             \
    ((x) == TIMER4_SEVT_MASK_15))

#define IS_VALID_TIMER4_SEVT_TRIG_EVT(x)                                       \
(   ((x) == TIMER4_SEVT_TRIGGER_TMR4_SCMUH)     ||                             \
    ((x) == TIMER4_SEVT_TRIGGER_TMR4_SCMUL)     ||                             \
    ((x) == TIMER4_SEVT_TRIGGER_TMR4_SCMVH)     ||                             \
    ((x) == TIMER4_SEVT_TRIGGER_TMR4_SCMVL)     ||                             \
    ((x) == TIMER4_SEVT_TRIGGER_TMR4_SCMWH)     ||                             \
    ((x) == TIMER4_SEVT_TRIGGER_TMR4_SCMWL))

#define IS_VALID_TIMER4_SEVT_BUF_MODE(x)                                       \
(   ((x) == TIMER4_SEVT_BUF_DISABLE)            ||                             \
    ((x) == TIMER4_SEVT_BUF_CNT_ZERO)           ||                             \
    ((x) == TIMER4_SEVT_BUF_CNT_PEAK)           ||                             \
    ((x) == TIMER4_SEVT_BUF_CNT_ZERO_OR_PEAK))

#define IS_VALID_TIMER4_EMB_PWM_OP(x)                                          \
(   ((x) == TIMER4_EMB_TRIG_PWM_OP_NORMAL)      ||                             \
    ((x) == TIMER4_EMB_TRIG_PWM_OP_HOLD)        ||                             \
    ((x) == TIMER4_EMB_TRIG_PWM_OP_HIZ)         ||                             \
    ((x) == TIMER4_EMB_TRIG_PWM_OP_LOW)         ||                             \
    ((x) == TIMER4_EMB_TRIG_PWM_OP_HIGH))

/**
 * @}
 */

/**
 * @defgroup TIMER4_OCO_Register TIMER4 OCO Register
 * @brief Get the specified OCO register address of the specified Timer4 unit
 * @{
 */
#define TMR4_OCCRx(__TMR4x__, __CH__)       ((__IO uint16_t *)((uint32_t)(&((__TMR4x__)->OCCRUH)) + ((uint32_t)(__CH__))*4ul))
#define TMR4_OCMRx(__TMR4x__, __CH__)       ((__IO uint16_t *)((uint32_t)(&((__TMR4x__)->OCMRHUH)) + ((uint32_t)(__CH__))*4ul))
#define TMR4_OCERx(__TMR4x__, __CH__)       ((__IO uint16_t *)((uint32_t)(&((__TMR4x__)->OCERU)) + (((uint32_t)(__CH__))/2ul)*4ul))
#define TMR4_OCSRx(__TMR4x__, __CH__)       ((__IO uint16_t *)((uint32_t)(&((__TMR4x__)->OCSRU)) + (((uint32_t)(__CH__))/2ul)*4ul))
/**
 * @}
 */

/**
 * @defgroup TIMER4_PWM_Register TIMER4 PWM Register
 * @brief Get the specified PWM register address of the specified Timer4 unit
 * @{
 */
#define TMR4_RCSRx(__TMR4x__)               ((__IO uint16_t *)((uint32_t)(&((__TMR4x__)->RCSR))))
#define TMR4_POCRx(__TMR4x__, __CH__)       ((__IO uint16_t *)((uint32_t)(&((__TMR4x__)->POCRU)) + ((uint32_t)(__CH__))*4ul))
#define TMR4_PDARx(__TMR4x__, __CH__)       ((__IO uint16_t *)((uint32_t)(&((__TMR4x__)->PDARU)) + ((uint32_t)(__CH__))*8ul))
#define TMR4_PDBRx(__TMR4x__, __CH__)       ((__IO uint16_t *)((uint32_t)(&((__TMR4x__)->PDBRU)) + ((uint32_t)(__CH__))*8ul))
#define TMR4_PFSRx(__TMR4x__, __CH__)       ((__IO uint16_t *)((uint32_t)(&((__TMR4x__)->PFSRU)) + ((uint32_t)(__CH__))*8ul))
/**
 * @}
 */

/**
 * @defgroup TMR4_RCSR_Bit TMR4_RCSR Bit
 * @brief Get the specified TMR4_RCSR register bis value of the specified Timer4 PWM channel
 * @{
 */
#define TMR4_RCSR_RTIDx(__CH__)             ((uint16_t)(TMR4_RCSR_RTIDU << (__CH__)))
#define TMR4_RCSR_RTIFx(__CH__)             ((uint16_t)(TMR4_RCSR_RTIFU << ((__CH__)*4u)))
#define TMR4_RCSR_RTICx(__CH__)             ((uint16_t)(TMR4_RCSR_RTICU <<((__CH__)*4u)))
#define TMR4_RCSR_RTEx(__CH__)              ((uint16_t)(TMR4_RCSR_RTEU << ((__CH__)*4u)))
#define TMR4_RCSR_RTSx(__CH__)              ((uint16_t)(TMR4_RCSR_RTSU << ((__CH__)*4u)))
/**
 * @}
 */

/**
 * @defgroup TIMER4_SEVT_Register TIMER4 SEVT Register
 * @brief Get the specified SEVT register address of the specified Timer4 unit
 * @{
 */
#define TMR4_SCCRx(__TMR4x__, __CH__)       ((__IO uint16_t *)((uint32_t)(&((__TMR4x__)->SCCRUH)) + ((uint32_t)(__CH__))*4ul))
#define TMR4_SCSRx(__TMR4x__, __CH__)       ((__IO uint16_t *)((uint32_t)(&((__TMR4x__)->SCSRUH)) + ((uint32_t)(__CH__))*4ul))
#define TMR4_SCMRx(__TMR4x__, __CH__)       ((__IO uint16_t *)((uint32_t)(&((__TMR4x__)->SCMRUH)) + ((uint32_t)(__CH__))*4ul))
/**
 * @}
 */

/**
 * @defgroup TIMER4_EMB_Register TIMER4 EMB Register
 * @brief Get the specified EMB register address of the specified Timer4 unit
 * @{
 */
#define TMR4_ESCRx(__TMR4x__)               ((__IO uint32_t *)((uint32_t)(&((__TMR4x__)->ECSR))))
/**
 * @}
 */

/**
 * @}
 */

