hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_timer4.c
/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/**
 * @defgroup TIMER4_Global_Functions TIMER4 Global Functions
 * @{
 */

/**
 * @defgroup TIMER4_CNT_Global_Functions TIMER4 Counter Global Functions
 * @{
 */

/**
 * @brief  Initialize Timer4 CNT.
 * @param  [in] pstcInit                Pointer to a @ref stc_timer4_cnt_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: pstcInit = NULL
 */
en_result_t TIMER4_CNT_Init(const stc_timer4_cnt_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        /* Check parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInit->enBufferCmd));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInit->enZeroIntCmd));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInit->enPeakIntCmd));
        DDL_ASSERT(IS_VALID_TIMER4_CNT_MODE(pstcInit->u16CntMode));
        DDL_ASSERT(IS_VALID_TIMER4_CNT_CLK_DIV(pstcInit->u16ClkDiv));
        DDL_ASSERT(IS_VALID_TIMER4_CNT_CLK_SRC(pstcInit->u16ClkSrc));
        DDL_ASSERT(IS_VALID_TIMER4_CNT_INT_MSK(pstcInit->u16ZeroIntMask));
        DDL_ASSERT(IS_VALID_TIMER4_CNT_INT_MSK(pstcInit->u16PeakIntMask));

        /* Set default value */
        WRITE_REG16(M0P_TMR4->CCSR, 0x0050u);
        WRITE_REG16(M0P_TMR4->CVPR, 0x0000u);

        /* Set count clock div && cnt mode && buffer enable bit && external clock enable bit && interrupt enable bit */
        WRITE_REG16(M0P_TMR4->CCSR, \
                    (pstcInit->u16ClkDiv  | \
                     pstcInit->u16ClkSrc  | \
                     pstcInit->u16CntMode | \
                     TMR4_CCSR_STOP       | \
                     (uint16_t)((uint16_t)pstcInit->enBufferCmd  << TMR4_CCSR_BUFEN_POS)  | \
                     (uint16_t)((uint16_t)pstcInit->enZeroIntCmd << TMR4_CCSR_IRQZEN_POS) | \
                     (uint16_t)((uint16_t)pstcInit->enPeakIntCmd << TMR4_CCSR_IRQPEN_POS)));

        /* set interrupt mask times */
        WRITE_REG16(M0P_TMR4->CVPR, (pstcInit->u16ZeroIntMask | ((uint16_t)(pstcInit->u16PeakIntMask << TMR4_CVPR_PIM_POS))));

        /* Set Timer4 cycle */
        WRITE_REG16(M0P_TMR4->CPSR, pstcInit->u16CycleVal);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_timer4_cnt_init_t to default values
 * @param  [out] pstcInit               Pointer to a @ref stc_timer4_cnt_init_t structure (M0P_TMR4 unit base function configuration data structure)
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: pstcInit = NULL
 */
en_result_t TIMER4_CNT_StructInit(stc_timer4_cnt_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        pstcInit->u16CycleVal = 0xFFFFu;
        pstcInit->u16CntMode = TIMER4_CNT_MODE_SAWTOOTH_WAVE;
        pstcInit->u16ClkSrc = TIMER4_CNT_PCLK;
        pstcInit->u16ClkDiv = TIMER4_CNT_CLK_DIV1;
        pstcInit->u16ZeroIntMask = TIMER4_CNT_INT_MASK_0;
        pstcInit->u16PeakIntMask = TIMER4_CNT_INT_MASK_0;
        pstcInit->enBufferCmd = Disable;
        pstcInit->enZeroIntCmd = Disable;
        pstcInit->enPeakIntCmd = Disable;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-Initialize Timer4 count function
 * @retval An en_result_t enumeration value:
 *           - Ok: De-Initialize success
 */
en_result_t TIMER4_CNT_DeInit(void)
{
    /* Configures the registers to reset value. */
    WRITE_REG16(M0P_TMR4->CCSR, 0x0050u);
    WRITE_REG16(M0P_TMR4->CPSR, 0xFFFFu);
    WRITE_REG16(M0P_TMR4->CVPR, 0x0000u);

    return Ok;
}

/**
 * @brief  Set Timer4 counter clock division
 * @param  [in] u16Div                  TimerB clock division
 *         This parameter can be one of the following values:
 *           @arg TIMER4_CNT_CLK_DIV1:      HCLK
 *           @arg TIMER4_CNT_CLK_DIV2:      HCLK/2
 *           @arg TIMER4_CNT_CLK_DIV4:      HCLK/4
 *           @arg TIMER4_CNT_CLK_DIV8:      HCLK/8
 *           @arg TIMER4_CNT_CLK_DIV16:     HCLK/16
 *           @arg TIMER4_CNT_CLK_DIV32:     HCLK/32
 *           @arg TIMER4_CNT_CLK_DIV64:     HCLK/64
 *           @arg TIMER4_CNT_CLK_DIV128:    HCLK/128
 *           @arg TIMER4_CNT_CLK_DIV256:    HCLK/256
 *           @arg TIMER4_CNT_CLK_DIV512:    HCLK/512
 *           @arg TIMER4_CNT_CLK_DIV1024:   HCLK/1024
 * @retval None
 */
void TIMER4_CNT_SetClkDiv(uint16_t u16Div)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TIMER4_CNT_CLK_DIV(u16Div));

    MODIFY_REG16(M0P_TMR4->CCSR, TMR4_CCSR_CKDIV, u16Div);
}

/**
 * @brief  Get Timer4 counter clock division
 * @param  None
 * @retval Returned value can be one of the following values:
 *           @arg TIMER4_CNT_CLK_DIV1:      HCLK
 *           @arg TIMER4_CNT_CLK_DIV2:      HCLK/2
 *           @arg TIMER4_CNT_CLK_DIV4:      HCLK/4
 *           @arg TIMER4_CNT_CLK_DIV8:      HCLK/8
 *           @arg TIMER4_CNT_CLK_DIV16:     HCLK/16
 *           @arg TIMER4_CNT_CLK_DIV32:     HCLK/32
 *           @arg TIMER4_CNT_CLK_DIV64:     HCLK/64
 *           @arg TIMER4_CNT_CLK_DIV128:    HCLK/128
 *           @arg TIMER4_CNT_CLK_DIV256:    HCLK/256
 *           @arg TIMER4_CNT_CLK_DIV512:    HCLK/512
 *           @arg TIMER4_CNT_CLK_DIV1024:   HCLK/1024
 */
uint16_t TIMER4_CNT_GetClkDiv(void)
{
    return READ_REG16_BIT(M0P_TMR4->CCSR, TMR4_CCSR_CKDIV);
}

/**
 * @brief  Enable or disable specified Timer4 counter interrupt
 * @param  [in] u16IntSource            TimerB interrupt source
 *         This parameter can be one of the following values:
 *           @arg TIMER4_CNT_IT_PEAK:   Overflow interrupt
 *           @arg TIMER4_CNT_IT_ZERO:   Underflow interrupt
 * @param  [in] enNewSta                The function new state
 *           @arg  This parameter can be: Enable or Disable
 * @retval None
 */
void TIMER4_CNT_IntCmd(uint16_t u16IntSource, en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));
    DDL_ASSERT(IS_VALID_TIMER4_CNT_INT(u16IntSource));

