hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_timer4.c
    switch (u16IntSource)
    {
        case TIMER4_CNT_IT_ZERO:
            u16MaskTimes = (uint16_t)(READ_REG16_BIT(M0P_TMR4->CVPR, TMR4_CVPR_ZIM) >> TMR4_CVPR_ZIM_POS);
            break;
        case TIMER4_CNT_IT_PEAK:
            u16MaskTimes = (uint16_t)(READ_REG16_BIT(M0P_TMR4->CVPR, TMR4_CVPR_PIM) >> TMR4_CVPR_PIM_POS);
            break;
        default:
            u16MaskTimes = TIMER4_RESULT_ERROR;
            break;
    }

    return u16MaskTimes;
}

/**
 * @brief  Get Timer4 CNT interrupt mask current times
 * @param  [in] u16IntSource            TimerB interrupt source
 *         This parameter can be one of the following values:
 *           @arg TIMER4_CNT_IT_PEAK:   Overflow interrupt
 *           @arg TIMER4_CNT_IT_ZERO:   Underflow interrupt
 * @retval Returned value can be one of the following values:
 *           @arg TIMER4_CNT_INT_MASK_0:    CNT interrupt flag is always set(not masked) for every CNT count at "0x0000" or peak
 *           @arg TIMER4_CNT_INT_MASK_1:    CNT interrupt flag is set once for 2 every CNT counts at "0x0000" or peak (skiping 1 count)
 *           @arg TIMER4_CNT_INT_MASK_2:    CNT interrupt flag is set once for 3 every CNT counts at "0x0000" or peak (skiping 2 count)
 *           @arg TIMER4_CNT_INT_MASK_3:    CNT interrupt flag is set once for 4 every CNT counts at "0x0000" or peak (skiping 3 count)
 *           @arg TIMER4_CNT_INT_MASK_4:    CNT interrupt flag is set once for 5 every CNT counts at "0x0000" or peak (skiping 4 count)
 *           @arg TIMER4_CNT_INT_MASK_5:    CNT interrupt flag is set once for 6 every CNT counts at "0x0000" or peak (skiping 5 count)
 *           @arg TIMER4_CNT_INT_MASK_6:    CNT interrupt flag is set once for 7 every CNT counts at "0x0000" or peak (skiping 6 count)
 *           @arg TIMER4_CNT_INT_MASK_7:    CNT interrupt flag is set once for 8 every CNT counts at "0x0000" or peak (skiping 7 count)
 *           @arg TIMER4_CNT_INT_MASK_8:    CNT interrupt flag is set once for 9 every CNT counts at "0x0000" or peak (skiping 8 count)
 *           @arg TIMER4_CNT_INT_MASK_9:    CNT interrupt flag is set once for 10 every CNT counts at "0x0000" or peak (skiping 9 count)
 *           @arg TIMER4_CNT_INT_MASK_10:   CNT interrupt flag is set once for 11 every CNT counts at "0x0000" or peak (skiping 10 count)
 *           @arg TIMER4_CNT_INT_MASK_11:   CNT interrupt flag is set once for 12 every CNT counts at "0x0000" or peak (skiping 11 count)
 *           @arg TIMER4_CNT_INT_MASK_12:   CNT interrupt flag is set once for 13 every CNT counts at "0x0000" or peak (skiping 12 count)
 *           @arg TIMER4_CNT_INT_MASK_13:   CNT interrupt flag is set once for 14 every CNT counts at "0x0000" or peak (skiping 13 count)
 *           @arg TIMER4_CNT_INT_MASK_14:   CNT interrupt flag is set once for 15 every CNT counts at "0x0000" or peak (skiping 14 count)
 *           @arg TIMER4_CNT_INT_MASK_15:   CNT interrupt flag is set once for 16 every CNT counts at "0x0000" or peak (skiping 15 count)
 *           @arg TIMER4_RESULT_ERROR:      TimerB interrupt source is invalid
 */
uint16_t TIMER4_CNT_GetIntMaskCurrenTimes(uint16_t u16IntSource)
{
    uint16_t u16MaskTimes;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TIMER4_CNT_INT(u16IntSource));

    switch (u16IntSource)
    {
        case TIMER4_CNT_IT_ZERO:
            u16MaskTimes = (uint16_t)(READ_REG16_BIT(M0P_TMR4->CVPR, TMR4_CVPR_ZIC) >> TMR4_CVPR_ZIC_POS);
            break;
        case TIMER4_CNT_IT_PEAK:
            u16MaskTimes = (uint16_t)(READ_REG16_BIT(M0P_TMR4->CVPR, TMR4_CVPR_PIC) >> TMR4_CVPR_PIC_POS);
            break;
        default:
            u16MaskTimes = TIMER4_RESULT_ERROR;
            break;
    }

    return u16MaskTimes;
}
/**
 * @}
 */

/**
 * @defgroup TIMER4_OCO_Global_Functions TIMER4 OCO Global Functions
 * @{
 */

/**
 * @brief  Initialize Timer4 OCO
 * @param  [in] u32Ch               Timer4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_OCO_UH:    Timer4 OCO channel:UH
 *           @arg TIMER4_OCO_UL:    Timer4 OCO channel:UL
 *           @arg TIMER4_OCO_VH:    Timer4 OCO channel:VH
 *           @arg TIMER4_OCO_VL:    Timer4 OCO channel:VL
 *           @arg TIMER4_OCO_WH:    Timer4 OCO channel:WH
 *           @arg TIMER4_OCO_WL:    Timer4 OCO channel:WL
 * @param  [in] pstcInit            Pointer to a @ref stc_timer4_oco_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: u32Ch is invalid or pstcInit = NULL
 */
en_result_t TIMER4_OCO_Init(uint32_t u32Ch,
                                const stc_timer4_oco_init_t *pstcInit)
{
    __IO uint16_t *TMR4_OCER;
    __IO uint16_t *TMR4_OCSR;
    __IO uint16_t *TMR4_OCCR;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if ((IS_VALID_TIMER4_OCO_CH(u32Ch)) && (NULL != pstcInit))
    {
        /* Check parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInit->enOcoCmd));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInit->enOcoIntCmd));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInit->enOccrLinkTransfer));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInit->enOcmrLinkTransfer));
        DDL_ASSERT(IS_VALID_TIMER4_OCO_OCCR_BUF_MODE(pstcInit->u16OccrBufMode));
        DDL_ASSERT(IS_VALID_TIMER4_OCO_OCMR_BUF_MODE(pstcInit->u16OcmrBufMode));
        DDL_ASSERT(IS_VALID_TIMER4_OCO_PORT_INVALID_OP(pstcInit->u16OcoInvalidOp));

        enRet = Ok;
        /* Get pointer of current channel OCO register address */
        TMR4_OCSR = TMR4_OCSRx(M0P_TMR4, u32Ch);
        TMR4_OCER = TMR4_OCERx(M0P_TMR4, u32Ch);
        TMR4_OCCR = TMR4_OCCRx(M0P_TMR4, u32Ch);

        /* Set OCMR and OCCR buffer mode */
        if (IS_VALID_TIMER4_OCO_HIGH_CH(u32Ch)) /* channel: TIMER4_OCO_UH, TIMER4_OCO_VH, TIMER4_OCO_WH */
        {
            /* Set port output valid && OP level && interrupt */
            MODIFY_REG16(*TMR4_OCSR, \
                         (TMR4_OCSR_OCEH  | \
                          TMR4_OCSR_OCPH  | \
                          TMR4_OCSR_OCIEH | \
                          TMR4_OCSR_OCFH),  \
                         ((uint16_t)((uint16_t)pstcInit->enOcoCmd << TMR4_OCSR_OCEH_POS)    | \
                          (uint16_t)(pstcInit->u16OcoInvalidOp << TMR4_OCSR_OCPH_POS)       | \
                          (uint16_t)((uint16_t)pstcInit->enOcoIntCmd << TMR4_OCSR_OCIEH_POS)));

            /* Set OCMR&&OCCR buffer */
            MODIFY_REG16(*TMR4_OCER, \
                         (TMR4_OCER_CHBUFEN | \
                          TMR4_OCER_MHBUFEN | \
                          TMR4_OCER_LMCH    | \
                          TMR4_OCER_LMMH),    \
                         ((uint16_t)(pstcInit->u16OccrBufMode << TMR4_OCER_CHBUFEN_POS)  | \
                          (uint16_t)(pstcInit->u16OcmrBufMode << TMR4_OCER_MHBUFEN_POS)  | \
                          (uint16_t)((uint16_t)pstcInit->enOccrLinkTransfer << TMR4_OCER_LMCH_POS) | \
                          (uint16_t)((uint16_t)pstcInit->enOcmrLinkTransfer << TMR4_OCER_LMMH_POS)));
        }
        else if (IS_VALID_TIMER4_OCO_LOW_CH(u32Ch)) /* channel: TIMER4_OCO_UL, TIMER4_OCO_VL, TIMER4_OCO_WL */
        {
            /* Set port output valid && OP level && interrupt */
            MODIFY_REG16(*TMR4_OCSR, \
                         (TMR4_OCSR_OCEL  | \
                          TMR4_OCSR_OCPL  | \
                          TMR4_OCSR_OCIEL | \
                          TMR4_OCSR_OCFL),  \
                         ((uint16_t)((uint16_t)pstcInit->enOcoCmd << TMR4_OCSR_OCEL_POS)    | \
                          (uint16_t)(pstcInit->u16OcoInvalidOp << TMR4_OCSR_OCPL_POS)       | \
                          (uint16_t)((uint16_t)pstcInit->enOcoIntCmd << TMR4_OCSR_OCIEL_POS)));

            /* Set OCMR&&OCCR buffer */
            MODIFY_REG16(*TMR4_OCER, \
                         (TMR4_OCER_CLBUFEN | \
                          TMR4_OCER_MLBUFEN | \
                          TMR4_OCER_LMCL    | \
                          TMR4_OCER_LMML),    \
                         ((uint16_t)(pstcInit->u16OccrBufMode << TMR4_OCER_CLBUFEN_POS)  | \
                          (uint16_t)(pstcInit->u16OcmrBufMode << TMR4_OCER_MLBUFEN_POS)  | \
                          (uint16_t)((uint16_t)pstcInit->enOccrLinkTransfer << TMR4_OCER_LMCL_POS) | \
                          (uint16_t)((uint16_t)pstcInit->enOcmrLinkTransfer << TMR4_OCER_LMML_POS)));
        }
        else
        {
            enRet = ErrorInvalidParameter;;
        }

        /* Set OCO compare match value */
        WRITE_REG16(*TMR4_OCCR, pstcInit->u16OccrVal);
    }

    return enRet;
}

/**
 * @brief  Initialize Timer4 OCO
 * @brief  Set the fields of structure stc_timer4_oco_init_t to default values
 * @param  [out] pstcInit               Pointer to a @ref stc_timer4_oco_init_t structure (TMRBx unit OCO function configuration data structure)
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: pstcInit = NULL
 */
en_result_t TIMER4_OCO_StructInit(stc_timer4_oco_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

