hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_timer4.c
    /* Set OCMR buffer mode */
    if (IS_VALID_TIMER4_OCO_HIGH_CH(u32Ch))     /* channel: TIMER4_OCO_UH, TIMER4_OCO_VH, TIMER4_OCO_WH */
    {
        MODIFY_REG16(*TMR4_OCER, TMR4_OCER_MHBUFEN, (uint16_t)(u16OcmrBufMode << TMR4_OCER_MHBUFEN_POS));
    }
    else if (IS_VALID_TIMER4_OCO_LOW_CH(u32Ch)) /* channel: TIMER4_OCO_UL, TIMER4_OCO_VL, TIMER4_OCO_WL */
    {
        MODIFY_REG16(*TMR4_OCER, TMR4_OCER_MLBUFEN, (uint16_t)(u16OcmrBufMode << TMR4_OCER_MLBUFEN_POS));
    }
    else
    {
        enRet = ErrorInvalidParameter;
    }

    return enRet;
}

/**
 * @brief  Get Timer4 OCO OCMR buffer mode
 * @param  [in] u32Ch               Timer4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_OCO_UH:    Timer4 OCO channel:UH
 *           @arg TIMER4_OCO_UL:    Timer4 OCO channel:UL
 *           @arg TIMER4_OCO_VH:    Timer4 OCO channel:VH
 *           @arg TIMER4_OCO_VL:    Timer4 OCO channel:VL
 *           @arg TIMER4_OCO_WH:    Timer4 OCO channel:WH
 *           @arg TIMER4_OCO_WL:    Timer4 OCO channel:WL
 * @retval Returned value can be one of the following values:
 *         This parameter can be one of the following values:
 *           @arg TIMER4_OCO_OCMR_BUF_DISABLE:          Disable the register OCMR buffer function
 *           @arg TIMER4_OCO_OCMR_BUF_CNT_ZERO:         Register OCMR buffer transfer when counter value is 0x0000
 *           @arg TIMER4_OCO_OCMR_BUF_CNT_PEAK:         Register OCMR buffer transfer when counter value is CPSR
 *           @arg TIMER4_OCO_OCMR_BUF_CNT_ZERO_OR_PEAK: Register OCMR buffer transfer when the value is both 0 and CPSR
 *           @arg TIMER4_RESULT_ERROR:                  Timer4 OCO channel is invalid
 */
uint16_t TIMER4_OCO_GetOcmrBufMode(uint32_t u32Ch)
{
    uint16_t u16OcmrBufMode;
    __IO uint16_t *TMR4_OCER;

    /* Get pointer of current channel OCO register address */
    TMR4_OCER = TMR4_OCERx(M0P_TMR4, u32Ch);

    /* Get OCMR buffer mode */
    if (IS_VALID_TIMER4_OCO_HIGH_CH(u32Ch))     /* channel: TIMER4_OCO_UH, TIMER4_OCO_VH, TIMER4_OCO_WH */
    {
        u16OcmrBufMode = (READ_REG16_BIT(*TMR4_OCER, TMR4_OCER_MHBUFEN) >> TMR4_OCER_MHBUFEN_POS);
    }
    else if (IS_VALID_TIMER4_OCO_LOW_CH(u32Ch)) /* channel: TIMER4_OCO_UL, TIMER4_OCO_VL, TIMER4_OCO_WL */
    {
        u16OcmrBufMode = (READ_REG16_BIT(*TMR4_OCER, TMR4_OCER_MLBUFEN) >> TMR4_OCER_MLBUFEN_POS);
    }
    else
    {
        u16OcmrBufMode = TIMER4_RESULT_ERROR;
    }

    return u16OcmrBufMode;
}

/**
 * @brief  Set Timer4 OCO OCMR buffer link transfer function
 * @param  [in] u32Ch               Timer4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_OCO_UH:    Timer4 OCO channel:UH
 *           @arg TIMER4_OCO_UL:    Timer4 OCO channel:UL
 *           @arg TIMER4_OCO_VH:    Timer4 OCO channel:VH
 *           @arg TIMER4_OCO_VL:    Timer4 OCO channel:VL
 *           @arg TIMER4_OCO_WH:    Timer4 OCO channel:WH
 *           @arg TIMER4_OCO_WL:    Timer4 OCO channel:WL
 * @param  [in] enNewSta            The function new state
 *           @arg  This parameter can be: Enable or Disable
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: u32Ch is invalid
 */
en_result_t TIMER4_OCO_OcmrLinkTransferCmd(uint32_t u32Ch,
                                en_functional_state_t enNewSta)
{
    __IO uint16_t *TMR4_OCER;
    en_result_t enRet = Ok;

    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    /* Get pointer of current channel OCO register address */
    TMR4_OCER = TMR4_OCERx(M0P_TMR4, u32Ch);

    /* Set OCCR link transfer */
    if (IS_VALID_TIMER4_OCO_HIGH_CH(u32Ch))     /* channel: TIMER4_OCO_UH, TIMER4_OCO_VH, TIMER4_OCO_WH */
    {
        MODIFY_REG16(*TMR4_OCER, TMR4_OCER_LMMH, ((uint16_t)enNewSta << TMR4_OCER_LMMH_POS));
    }
    else if (IS_VALID_TIMER4_OCO_LOW_CH(u32Ch)) /* channel: TIMER4_OCO_UL, TIMER4_OCO_VL, TIMER4_OCO_WL */
    {
        MODIFY_REG16(*TMR4_OCER, TMR4_OCER_LMML, ((uint16_t)enNewSta << TMR4_OCER_LMML_POS));
    }
    else
    {
        enRet = ErrorInvalidParameter;
    }

    return enRet;
}

/**
 * @brief  Extend the matching conditions of Timer4 OCO channel
 * @param  [in] u32Ch               Timer4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_OCO_UH:    Timer4 OCO channel:UH
 *           @arg TIMER4_OCO_UL:    Timer4 OCO channel:UL
 *           @arg TIMER4_OCO_VH:    Timer4 OCO channel:VH
 *           @arg TIMER4_OCO_VL:    Timer4 OCO channel:VL
 *           @arg TIMER4_OCO_WH:    Timer4 OCO channel:WH
 *           @arg TIMER4_OCO_WL:    Timer4 OCO channel:WL
 * @param  [in] enNewSta            The function new state
 *           @arg  This parameter can be: Enable or Disable
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: u32Ch is invalid
 */
en_result_t TIMER4_OCO_ExtMatchCondCmd(uint32_t u32Ch,
                                en_functional_state_t enNewSta)
{
    __IO uint16_t *TMR4_OCER;
    en_result_t enRet = Ok;

    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    /* Get pointer of current channel OCO register address */
    TMR4_OCER = TMR4_OCERx(M0P_TMR4, u32Ch);

    if (IS_VALID_TIMER4_OCO_HIGH_CH(u32Ch))     /* channel: TIMER4_OCO_UH, TIMER4_OCO_VH, TIMER4_OCO_WH */
    {
        MODIFY_REG16(*TMR4_OCER, TMR4_OCER_MCECH, ((uint16_t)enNewSta << TMR4_OCER_MCECH_POS));
    }
    else if (IS_VALID_TIMER4_OCO_LOW_CH(u32Ch)) /* channel: TIMER4_OCO_UL, TIMER4_OCO_VL, TIMER4_OCO_WL */
    {
        MODIFY_REG16(*TMR4_OCER, TMR4_OCER_MCECL, ((uint16_t)enNewSta << TMR4_OCER_MCECL_POS));
    }
    else
    {
        enRet = ErrorInvalidParameter;
    }

    return enRet;
}

/**
 * @brief  Set the Timer4 OCO high channel mode
 * @param  [in] u32Ch               Timer4 OCO channel.
 *         This parameter can be one of the following values:
 *           @arg TIMER4_OCO_UH:    Timer4 OCO channel:UH
 *           @arg TIMER4_OCO_VH:    Timer4 OCO channel:VH
 *           @arg TIMER4_OCO_WH:    Timer4 OCO channel:WH
 * @param  [in] pstcMode            Pointer to a @ref stc_oco_high_ch_compare_mode_t structure of the Timer4 OCO high channel mode
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: u32Ch is invalid or pstcMode = NULL
 */
en_result_t TIMER4_OCO_SetHighChCompareMode(uint32_t u32Ch,
                                const stc_oco_high_ch_compare_mode_t *pstcMode)
{
    __IO uint16_t *TMR4_OCER;
    __IO uint16_t *TMR4_OCMR;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check OCO channel && pstcMode pointer */
    if ((IS_VALID_TIMER4_OCO_HIGH_CH(u32Ch)) && (NULL != pstcMode))
    {
        /* Check parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcMode->enExtendMatchCondCmd));

        /* Get pointer of current channel OCO register address */
        TMR4_OCER = TMR4_OCERx(M0P_TMR4, u32Ch);
        TMR4_OCMR = TMR4_OCMRx(M0P_TMR4, u32Ch);

        WRITE_REG16(*TMR4_OCMR, pstcMode->OCMRx);
        MODIFY_REG16(*TMR4_OCER, TMR4_OCER_MCECH, ((uint16_t)pstcMode->enExtendMatchCondCmd << TMR4_OCER_MCECH_POS));
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set the Timer4 OCO low channel mode
 * @param  [in] u32Ch               Timer4 OCO channel.
 *         This parameter can be one of the following values:
 *           @arg TIMER4_OCO_UH:    Timer4 OCO channel:UH
 *           @arg TIMER4_OCO_VH:    Timer4 OCO channel:VH
 *           @arg TIMER4_OCO_WH:    Timer4 OCO channel:WH
 * @param  [in] pstcMode            Pointer to a @ref stc_oco_low_ch_compare_mode_t structure of the Timer4 OCO low channel mode
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: u32Ch is invalid or pstcMode = NULL
 */
en_result_t TIMER4_OCO_SetLowChCompareMode(uint32_t u32Ch,
                                 const stc_oco_low_ch_compare_mode_t *pstcMode)
{
    __IO uint16_t *TMR4_OCER;
    __IO uint32_t *TMR4_OCMR;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check OCO channel && pstcMode pointer */
    if ((IS_VALID_TIMER4_OCO_LOW_CH(u32Ch)) && (NULL != pstcMode))
    {
        /* Check parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcMode->enExtendMatchCondCmd));

        /* Get pointer of current channel OCO register address */
        TMR4_OCER = TMR4_OCERx(M0P_TMR4, u32Ch);
        TMR4_OCMR = (__IO uint32_t*)TMR4_OCMRx(M0P_TMR4, u32Ch);

