hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_timer4.c
        WRITE_REG32(*TMR4_OCMR, pstcMode->OCMRx);
        MODIFY_REG16(*TMR4_OCER, TMR4_OCER_MCECL, ((uint16_t)pstcMode->enExtendMatchCondCmd << TMR4_OCER_MCECL_POS));
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set the Timer4 OCO low channel mode
 * @param  [in] u32Ch               Timer4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_OCO_UH:    Timer4 OCO channel:UH
 *           @arg TIMER4_OCO_UL:    Timer4 OCO channel:UL
 *           @arg TIMER4_OCO_VH:    Timer4 OCO channel:VH
 *           @arg TIMER4_OCO_VL:    Timer4 OCO channel:VL
 *           @arg TIMER4_OCO_WH:    Timer4 OCO channel:WH
 *           @arg TIMER4_OCO_WL:    Timer4 OCO channel:WL
 * @param  [in] enNewSta            The function new state
 *           @arg  This parameter can be: Enable or Disable
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: u32Ch is invalid
 */
en_result_t TIMER4_OCO_OutputCompareCmd(uint32_t u32Ch,
                                en_functional_state_t enNewSta)
{
    __IO uint16_t *TMR4_OCSR;
    en_result_t enRet = Ok;

    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    /* Get pointer of current channel OCO register address */
    TMR4_OCSR = TMR4_OCSRx(M0P_TMR4, u32Ch);

    /* Set OCO valid */
    if (IS_VALID_TIMER4_OCO_HIGH_CH(u32Ch))     /* channel: TIMER4_OCO_UH, TIMER4_OCO_VH, TIMER4_OCO_WH */
    {
        MODIFY_REG16(*TMR4_OCSR, TMR4_OCSR_OCEH, ((uint16_t)enNewSta << TMR4_OCSR_OCEH_POS));
    }
    else if (IS_VALID_TIMER4_OCO_LOW_CH(u32Ch)) /* channel: TIMER4_OCO_UL, TIMER4_OCO_VL, TIMER4_OCO_WL */
    {
        MODIFY_REG16(*TMR4_OCSR, TMR4_OCSR_OCEL, ((uint16_t)enNewSta << TMR4_OCSR_OCEL_POS));
    }
    else
    {
        enRet = ErrorInvalidParameter;
    }

    return enRet;
}

/**
 * @brief  Set the Timer4 OCO interrupt function
 * @param  [in] u32Ch               Timer4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_OCO_UH:    Timer4 OCO channel:UH
 *           @arg TIMER4_OCO_UL:    Timer4 OCO channel:UL
 *           @arg TIMER4_OCO_VH:    Timer4 OCO channel:VH
 *           @arg TIMER4_OCO_VL:    Timer4 OCO channel:VL
 *           @arg TIMER4_OCO_WH:    Timer4 OCO channel:WH
 *           @arg TIMER4_OCO_WL:    Timer4 OCO channel:WL
 * @param  [in] enNewSta            The function new state
 *           @arg  This parameter can be: Enable or Disable
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: u32Ch is invalid
 */
en_result_t TIMER4_OCO_IntCmd(uint32_t u32Ch,
                                en_functional_state_t enNewSta)
{
    __IO uint16_t *TMR4_OCSR;
    en_result_t enRet = Ok;

    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    /* Get pointer of current channel OCO register address */
    TMR4_OCSR = TMR4_OCSRx(M0P_TMR4, u32Ch);

    if (IS_VALID_TIMER4_OCO_HIGH_CH(u32Ch))     /* channel: TIMER4_OCO_UH, TIMER4_OCO_VH, TIMER4_OCO_WH */
    {
        MODIFY_REG16(*TMR4_OCSR, TMR4_OCSR_OCIEH, ((uint16_t)enNewSta << TMR4_OCSR_OCIEH_POS));
    }
    else if (IS_VALID_TIMER4_OCO_LOW_CH(u32Ch)) /* channel: TIMER4_OCO_UL, TIMER4_OCO_VL, TIMER4_OCO_WL */
    {
        MODIFY_REG16(*TMR4_OCSR, TMR4_OCSR_OCIEL, ((uint16_t)enNewSta << TMR4_OCSR_OCIEL_POS));
    }
    else
    {
        enRet = ErrorInvalidParameter;
    }

    return enRet;
}

/**
 * @brief  Set the Timer4 OCO interrupt flag
 * @param  [in] u32Ch               Timer4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_OCO_UH:    Timer4 OCO channel:UH
 *           @arg TIMER4_OCO_UL:    Timer4 OCO channel:UL
 *           @arg TIMER4_OCO_VH:    Timer4 OCO channel:VH
 *           @arg TIMER4_OCO_VL:    Timer4 OCO channel:VL
 *           @arg TIMER4_OCO_WH:    Timer4 OCO channel:WH
 *           @arg TIMER4_OCO_WL:    Timer4 OCO channel:WL
 * @retval An en_flag_status_t enumeration value:
 *           - Reset:               None interrupt request flag is set on Timer4 OCO
 *           - Set:                 Detection interrupt request on Timer4 OCO
 */
en_flag_status_t TIMER4_OCO_GetFlag(uint32_t u32Ch)
{
    uint16_t u16Flag = 0u;
    __IO uint16_t *TMR4_OCSR;

    /* Get pointer of current channel OCO register address */
    TMR4_OCSR = TMR4_OCSRx(M0P_TMR4, u32Ch);

    if (IS_VALID_TIMER4_OCO_HIGH_CH(u32Ch))     /* channel: TIMER4_OCO_UH, TIMER4_OCO_VH, TIMER4_OCO_WH */
    {
        u16Flag = READ_REG16_BIT(*TMR4_OCSR, TMR4_OCSR_OCFH);
    }
    else if (IS_VALID_TIMER4_OCO_LOW_CH(u32Ch)) /* channel: TIMER4_OCO_UL, TIMER4_OCO_VL, TIMER4_OCO_WL */
    {
        u16Flag = READ_REG16_BIT(*TMR4_OCSR, TMR4_OCSR_OCFL);
    }
    else
    {
        /* Do nothing */
    }

    return (u16Flag ? Set : Reset);
}

/**
 * @brief  Clear the Timer4 OCO interrupt function
 * @param  [in] u32Ch               Timer4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_OCO_UH:    Timer4 OCO channel:UH
 *           @arg TIMER4_OCO_UL:    Timer4 OCO channel:UL
 *           @arg TIMER4_OCO_VH:    Timer4 OCO channel:VH
 *           @arg TIMER4_OCO_VL:    Timer4 OCO channel:VL
 *           @arg TIMER4_OCO_WH:    Timer4 OCO channel:WH
 *           @arg TIMER4_OCO_WL:    Timer4 OCO channel:WL
 * @retval An en_result_t enumeration value:
 *           - Ok: Clear successfully
 *           - ErrorInvalidParameter: u32Ch is invalid
 */
en_result_t TIMER4_OCO_ClearFlag(uint32_t u32Ch)
{
    __IO uint16_t *TMR4_OCSR;
    en_result_t enRet = Ok;

    /* Get pointer of current channel OCO register address */
    TMR4_OCSR = TMR4_OCSRx(M0P_TMR4, u32Ch);

    if (IS_VALID_TIMER4_OCO_HIGH_CH(u32Ch))     /* channel: TIMER4_OCO_UH, TIMER4_OCO_VH, TIMER4_OCO_WH */
    {
        CLEAR_REG16_BIT(*TMR4_OCSR, TMR4_OCSR_OCFH);
    }
    else if (IS_VALID_TIMER4_OCO_LOW_CH(u32Ch)) /* channel: TIMER4_OCO_UL, TIMER4_OCO_VL, TIMER4_OCO_WL */
    {
        CLEAR_REG16_BIT(*TMR4_OCSR, TMR4_OCSR_OCFL);
    }
    else
    {
        enRet = ErrorInvalidParameter;
    }

    return enRet;
}

/**
 * @brief  Set Timer4 OCO invalid output polarity
 * @param  [in] u32Ch               Timer4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_OCO_UH:    Timer4 OCO channel:UH
 *           @arg TIMER4_OCO_UL:    Timer4 OCO channel:UL
 *           @arg TIMER4_OCO_VH:    Timer4 OCO channel:VH
 *           @arg TIMER4_OCO_VL:    Timer4 OCO channel:VL
 *           @arg TIMER4_OCO_WH:    Timer4 OCO channel:WH
 *           @arg TIMER4_OCO_WL:    Timer4 OCO channel:WL
 * @param  [in] u16OutputPolarity   Timer4 OCO invalid output polarity.
 *         This parameter can be one of the following values:
 *           @arg TIMER4_OCO_INVAILD_OP_LOW:        TIM4_<t>_OxH/TIM4_<t>_OxL output low level when OCO is invalid
 *           @arg TIMER4_OCO_INVAILD_OP_HIGH:       TIM4_<t>_OxH/TIM4_<t>_OxL output high level when OCO is invalid
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: u32Ch is invalid
 */
en_result_t TIMER4_OCO_SetOcoInvalidOp(uint32_t u32Ch,
                                uint16_t u16OutputPolarity)
{
    __IO uint16_t *TMR4_OCSR;
    en_result_t enRet = Ok;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TIMER4_OCO_PORT_INVALID_OP(u16OutputPolarity));

    /* Get pointer of current channel OCO register address */
    TMR4_OCSR = TMR4_OCSRx(M0P_TMR4, u32Ch);

    /* Set OCCR buffer mode */
    if (IS_VALID_TIMER4_OCO_HIGH_CH(u32Ch))     /* channel: TIMER4_OCO_UH, TIMER4_OCO_VH, TIMER4_OCO_WH */
    {
        MODIFY_REG16(*TMR4_OCSR, TMR4_OCSR_OCPH, (uint16_t)(u16OutputPolarity << TMR4_OCSR_OCPH_POS));
    }
    else if (IS_VALID_TIMER4_OCO_LOW_CH(u32Ch)) /* channel: TIMER4_OCO_UL, TIMER4_OCO_VL, TIMER4_OCO_WL */
    {
        MODIFY_REG16(*TMR4_OCSR, TMR4_OCSR_OCPL, (uint16_t)(u16OutputPolarity << TMR4_OCSR_OCPL_POS));
    }
    else
    {
        enRet = ErrorInvalidParameter;
    }

    return enRet;
}

/**
 * @brief  Get Timer4 OCO output polarity
 * @param  [in] u32Ch               Timer4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_OCO_UH:    Timer4 OCO channel:UH
 *           @arg TIMER4_OCO_UL:    Timer4 OCO channel:UL
 *           @arg TIMER4_OCO_VH:    Timer4 OCO channel:VH
 *           @arg TIMER4_OCO_VL:    Timer4 OCO channel:VL
 *           @arg TIMER4_OCO_WH:    Timer4 OCO channel:WH
 *           @arg TIMER4_OCO_WL:    Timer4 OCO channel:WL
 * @retval Returned value can be one of the following values:
 *           @arg TIMER4_OCO_INVAILD_OP_LOW:        TIM4_<t>_OxH/TIM4_<t>_OxL output low level when OCO is invalid
 *           @arg TIMER4_OCO_INVAILD_OP_HIGH:       TIM4_<t>_OxH/TIM4_<t>_OxL output high level when OCO is invalid
 *           @arg TIMER4_RESULT_ERROR:              Timer4 OCO channel is invalid
 */
uint16_t TIMER4_OCO_GetOutputPolarity(uint32_t u32Ch)
{
    __IO uint16_t *TMR4_OCSR;
    uint16_t u16OutputPolarity;

    /* Get pointer of current channel OCO register address */
    TMR4_OCSR = TMR4_OCSRx(M0P_TMR4, u32Ch);

    /* Get OCCR buffer mode */
    if (IS_VALID_TIMER4_OCO_HIGH_CH(u32Ch))     /* channel: TIMER4_OCO_UH, TIMER4_OCO_VH, TIMER4_OCO_WH */
    {
        u16OutputPolarity = (READ_REG16_BIT(*TMR4_OCSR, TMR4_OCSR_OCPH) >> TMR4_OCSR_OCPH_POS);
    }
    else if (IS_VALID_TIMER4_OCO_LOW_CH(u32Ch)) /* channel: TIMER4_OCO_UL, TIMER4_OCO_VL, TIMER4_OCO_WL */
    {
        u16OutputPolarity = (READ_REG16_BIT(*TMR4_OCSR, TMR4_OCSR_OCPL) >> TMR4_OCSR_OCPL_POS);
    }
    else
    {
        u16OutputPolarity = TIMER4_RESULT_ERROR;
    }

    return u16OutputPolarity;
}

/**
 * @brief  Set Timer4 OCO OCCR register value
 * @param  [in] u32Ch               Timer4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_OCO_UH:    Timer4 OCO channel:UH
 *           @arg TIMER4_OCO_UL:    Timer4 OCO channel:UL
 *           @arg TIMER4_OCO_VH:    Timer4 OCO channel:VH
 *           @arg TIMER4_OCO_VL:    Timer4 OCO channel:VL
 *           @arg TIMER4_OCO_WH:    Timer4 OCO channel:WH
 *           @arg TIMER4_OCO_WL:    Timer4 OCO channel:WL
 * @param  [in] u16OccrVal          The Timer4 OCO OCCR register value
 *           @arg number of 16bit
 * @retval None
 */
void TIMER4_OCO_SetOccrVal(uint32_t u32Ch, uint16_t u16OccrVal)
{
    __IO uint16_t *TMR4_OCCR;

    DDL_ASSERT(IS_VALID_TIMER4_OCO_CH(u32Ch));

    /* Get pointer of current channel OCO register address */
    TMR4_OCCR = TMR4_OCCRx(M0P_TMR4, u32Ch);

    WRITE_REG16(*TMR4_OCCR, u16OccrVal);
}

/**
 * @brief  Get Timer4 OCO OCCR register value
 * @param  [in] u32Ch               Timer4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_OCO_UH:    Timer4 OCO channel:UH
 *           @arg TIMER4_OCO_UL:    Timer4 OCO channel:UL
 *           @arg TIMER4_OCO_VH:    Timer4 OCO channel:VH
 *           @arg TIMER4_OCO_VL:    Timer4 OCO channel:VL
 *           @arg TIMER4_OCO_WH:    Timer4 OCO channel:WH
 *           @arg TIMER4_OCO_WL:    Timer4 OCO channel:WL
 * @retval The OCCR register value of the Timer4 OCO
 */
uint16_t TIMER4_OCO_GetOccrVal(uint32_t u32Ch)
{
    __IO uint16_t *TMR4_OCCR;

    DDL_ASSERT(IS_VALID_TIMER4_OCO_CH(u32Ch));

    /* Get pointer of current channel OCO register address */
    TMR4_OCCR = TMR4_OCCRx(M0P_TMR4, u32Ch);

    return READ_REG16(*TMR4_OCCR);
}

/**
 * @}
 */

/**
 * @defgroup TIMER4_PWM_Global_Functions TIMER4 PWM Global Functions
 * @{
 */

/**
 * @brief  Initialize Timer4 PWM
 * @param  [in] u32Ch               Timer4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_PWM_U:     Timer4 PWM couple channel: U
 *           @arg TIMER4_PWM_V:     Timer4 PWM couple channel: V
 *           @arg TIMER4_PWM_W:     Timer4 PWM couple channel: W
 * @param  [in] pstcInit            Pointer to a @ref stc_timer4_pwm_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: u32Ch is invalid or pstcInit = NULL
 */
en_result_t TIMER4_PWM_Init(uint32_t u32Ch,
                                const stc_timer4_pwm_init_t *pstcInit)
{
    __IO uint16_t *TMR4_POCR;
    __IO uint16_t *TMR4_RCSR;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check channel && structure pointer */
    if ((IS_VALID_TIMER4_PWM_CH(u32Ch)) && (NULL != pstcInit))
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_TIMER4_PWM_MODE(pstcInit->u16Mode));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInit->enRtIntMaskCmd));
        DDL_ASSERT(IS_VALID_TIMER4_PWM_CLK_DIV(pstcInit->u16ClkDiv));
        DDL_ASSERT(IS_VALID_TIMER4_PWM_OUTPUT_POLARITY(pstcInit->u16PwmOutputPolarity));

        /* Get pointer of current channel PWM register address */
        TMR4_POCR = TMR4_POCRx(M0P_TMR4, u32Ch);
        TMR4_RCSR = TMR4_RCSRx(M0P_TMR4);

        /* Set POCR register */
        WRITE_REG16(*TMR4_POCR, (pstcInit->u16ClkDiv | pstcInit->u16Mode | pstcInit->u16PwmOutputPolarity));

        /* Set RCSR register */
        MODIFY_REG16(*TMR4_RCSR,
                      (TMR4_RCSR_RTIDx(u32Ch) | TMR4_RCSR_RTEx(u32Ch) | TMR4_RCSR_RTSx(u32Ch)), \
                      ((uint16_t)((uint16_t)pstcInit->enRtIntMaskCmd << u32Ch) | TMR4_RCSR_RTSx(u32Ch)));
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Initialize Timer4 PWM
 * @brief  Set the fields of structure stc_timer4_pwm_init_t to default values
 * @param  [out] pstcInit               Pointer to a @ref stc_timer4_pwm_init_t structure (TMRBx unit PWM function configuration data structure)
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: pstcInit = NULL
 */
en_result_t TIMER4_PWM_StructInit(stc_timer4_pwm_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

