hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_timer4.c
    /* Check structure pointer */
    if (IS_VALID_TIMER4_PWM_CH(u32Ch))
    {
        /* Get pointer of current channel PWM register address */
        TMR4_PDAR = TMR4_PDARx(M0P_TMR4, u32Ch);
        TMR4_PDBR = TMR4_PDBRx(M0P_TMR4, u32Ch);

        WRITE_REG16(*TMR4_PDAR, u16PDAR);
        WRITE_REG16(*TMR4_PDBR, u16PDBR);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Get Timer4 PWM dead region count
 * @param  [in] u32Ch               Timer4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_PWM_U:     Timer4 PWM couple channel: U
 *           @arg TIMER4_PWM_V:     Timer4 PWM couple channel: V
 *           @arg TIMER4_PWM_W:     Timer4 PWM couple channel: W
 * @param  [out] pu16PDAR           Pointer of 16bit data
 *           @arg pointer of 16bit
 * @param  [out] pu16PDBR           Pointer of 16bit data
 *           @arg pointer of 16bit
 * @retval An en_result_t enumeration value:
 *           - Ok: Get successfully
 *           - ErrorInvalidParameter: u32Ch is invalid
 */
en_result_t TIMER4_PWM_GetDeadRegionValue(uint32_t u32Ch,
                                                uint16_t *pu16PDAR,
                                                uint16_t *pu16PDBR)
{
    __IO uint16_t *TMR4_PDAR;
    __IO uint16_t *TMR4_PDBR;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (IS_VALID_TIMER4_PWM_CH(u32Ch))
    {
        /* Get pointer of current channel PWM register address */
        TMR4_PDAR = TMR4_PDARx(M0P_TMR4, u32Ch);
        TMR4_PDBR = TMR4_PDBRx(M0P_TMR4, u32Ch);

        *pu16PDAR = READ_REG16(*TMR4_PDAR);
        *pu16PDBR = READ_REG16(*TMR4_PDBR);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set Timer4 PWM filter count value
 * @param  [in] u32Ch               Timer4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_PWM_U:     Timer4 PWM couple channel: U
 *           @arg TIMER4_PWM_V:     Timer4 PWM couple channel: V
 *           @arg TIMER4_PWM_W:     Timer4 PWM couple channel: W
 * @param  [in] u16Count            Timer4 PWM filter count value
 *           @arg number of 16bit
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: u32Ch is invalid
 */
en_result_t TIMER4_PWM_SetFilterCountValue(uint32_t u32Ch,
                                                        uint16_t u16Count)
{
    __IO uint16_t *TMR4_PFSR;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (IS_VALID_TIMER4_PWM_CH(u32Ch))
    {
        /* Get pointer of current channel PWM register address */
        TMR4_PFSR = TMR4_PFSRx(M0P_TMR4, u32Ch);

        WRITE_REG16(*TMR4_PFSR, u16Count);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @}
 */

/**
 * @defgroup TIMER4_SEVT_Global_Functions TIMER4 SEVT Global Functions
 * @{
 */

/**
 * @brief  Initialize Timer4 SEVT
 * @param  [in] u32Ch               Timer4 SEVT channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_SEVT_UH    Timer4 SEVT channel:UH
 *           @arg TIMER4_SEVT_UL    Timer4 SEVT channel:UL
 *           @arg TIMER4_SEVT_VH    Timer4 SEVT channel:VH
 *           @arg TIMER4_SEVT_VL    Timer4 SEVT channel:VL
 *           @arg TIMER4_SEVT_WH    Timer4 SEVT channel:WH
 *           @arg TIMER4_SEVT_WL    Timer4 SEVT channel:WL
 * @param  [in] pstcInit            Pointer to a @ref stc_timer4_sevt_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: u32Ch is invalid or pstcInit = NULL
 */
en_result_t TIMER4_SEVT_Init(uint32_t u32Ch,
                                const stc_timer4_sevt_init_t *pstcInit)
{
    __IO uint16_t *TMR4_SCCR;
    __IO uint16_t *TMR4_SCSR;
    __IO uint16_t *TMR4_SCMR;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer && channel */
    if ((IS_VALID_TIMER4_SEVT_CH(u32Ch)) && (NULL != pstcInit))
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_TIMER4_SEVT_MODE(pstcInit->u16Mode));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInit->enLinkTransfer));
        DDL_ASSERT(IS_VALID_TIMER4_SEVT_TRIG_EVT(pstcInit->u16TrigEvt));
        DDL_ASSERT(IS_VALID_TIMER4_SEVT_BUF_MODE(pstcInit->u16BufMode));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInit->stcTriggerCond.enDownMatchCmd));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInit->stcTriggerCond.enPeakMatchCmd));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInit->stcTriggerCond.enUpMatchCmd));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInit->stcTriggerCond.enZeroMatchCmd));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInit->stcTriggerCond.enCmpAmcZicCmd));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInit->stcTriggerCond.enCmpAmcPicCmd));
        DDL_ASSERT(IS_VALID_TIMER4_SEVT_MASK(pstcInit->stcTriggerCond.u16MaskTimes));

        /* Get actual address of register list of current channel */
        TMR4_SCCR = TMR4_SCCRx(M0P_TMR4, u32Ch);
        TMR4_SCSR = TMR4_SCSRx(M0P_TMR4, u32Ch);
        TMR4_SCMR = TMR4_SCMRx(M0P_TMR4, u32Ch);

        /* Configure default parameter */
        WRITE_REG16(*TMR4_SCSR, 0x0000u);
        WRITE_REG16(*TMR4_SCMR, 0xFF00u);

        /* Set SCSR register */
        WRITE_REG16(*TMR4_SCSR,             \
                    (pstcInit->u16Mode    | \
                     pstcInit->u16TrigEvt | \
                     pstcInit->u16BufMode | \
                     (uint16_t)((uint16_t)pstcInit->enLinkTransfer << TMR4_SCSR_LMC_POS)                | \
                     (uint16_t)((uint16_t)pstcInit->stcTriggerCond.enDownMatchCmd << TMR4_SCSR_DEN_POS) | \
                     (uint16_t)((uint16_t)pstcInit->stcTriggerCond.enPeakMatchCmd << TMR4_SCSR_PEN_POS) | \
                     (uint16_t)((uint16_t)pstcInit->stcTriggerCond.enUpMatchCmd << TMR4_SCSR_UEN_POS)   | \
                     (uint16_t)((uint16_t)pstcInit->stcTriggerCond.enZeroMatchCmd << TMR4_SCSR_ZEN_POS)));

        /* Set SCMR register */
        WRITE_REG16(*TMR4_SCMR, \
                    (pstcInit->stcTriggerCond.u16MaskTimes | \
                     (uint16_t)((uint16_t)pstcInit->stcTriggerCond.enCmpAmcZicCmd << TMR4_SCMR_MZCE_POS) | \
                     (uint16_t)((uint16_t)pstcInit->stcTriggerCond.enCmpAmcPicCmd << TMR4_SCMR_MPCE_POS)));

        WRITE_REG16(*TMR4_SCCR, pstcInit->u16SccrVal);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Initialize Timer4 PWM
 * @brief  Set the fields of structure stc_timer4_pwm_init_t to default values
 * @param  [out] pstcInit               Pointer to a @ref stc_timer4_pwm_init_t structure (TMRBx unit PWM function configuration data structure)
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: pstcInit = NULL
 */
en_result_t TIMER4_SEVT_StructInit(stc_timer4_sevt_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

